20250707111411-lesson_4_plan_the_work_goal_finish.org
:PROPERTIES:
:ID:       2eeee4e0-4a91-461a-b6bc-b7b950be4940
:END:
#+title: Lesson 4 Plan the work (Goal - finish)
#+filetags: :SAFe


* 4.1 Creating the backlog
Work originates locally and from broader contexts
Agile team backlog is comprised of Stories

** Contains all the work for the team
** Created by the PO and the team
** Prioritized by the PO
** Contains User and Enabler Stories
*** User Stories provide Customers with value
*** Enabler stories build the infrastructure and architecture that makes User Stories Possibles

** Stories for near-term Iterations are more detailted than Stories for later Iterations
** NFRs are backlog contstraints

Backlog prioritization without connection to the user journey
*** Backlogs are optimized to help teams focus on priorities
**** Backlogs have some challenges
- Can be difficult to understand workflows
- Relationship between 'Stories that make something good' and 'Stories that make something better or great' is lost

*** Story maps overcome these challenges
- Overcome backlog challenges
- Story maps feed the backlog: quality, value

*** Acceptance Criteria
- Provide the details of the story from a testing pov
- Are created by the agile team
- Can be written in the Given-When-Then format

** Backlog Refinement
** Fibonacci is used for estimation

** Plan -> Do -> Check -> Adjust (At both an iteration and ART level)

* 4.2 PI Planning

** Innovation: Opportunity for innovation, hackathos and infrastructure improvements
** Planning: Provides for cadence-based planning

Buffer for leftover work
Final verification and validation, documentation
Innovation
PI Planning readiness

2 day event

*** Benefits
- Personal communication across all team members and stakeholders
- Aligns development of business goals with business context
- Identifies dependencies
- Allows for faster decision making

*** Create alignment with PI Objectives

- Objectives are business summaries of what each team intends to deliver in the upcoming PI
- Often directly relate to intended features in the backlog

  Before Value (BV)
  After Value (AV)

*** Uncomitted objectives
help improve the predictability of delivering business value.
- They are planned, not extra things teams do "just in case you have time"
- They are not included in the commitment
- If a team has low confidence in meeting a PI objective, it should be moved to uncommitted
- If an objective has many unknowns, consider moving to uncommitted and putting in early spikes.
- Uncommitted objectives count when calculating load

Outcomes of PI planning
- Communication
- Estimate Capacity
- Objectives
- Manage Risks

*** ROAMing Risks
- Resolved Has been addressed; No longer a concenrt
- Owned Someone has taken responsibility
- Accepted Nothing more can be done; if risk occurs, release may be compromised.
- Mitigated

* 4.3 Team Planning
** Purpose:
- Define and commit to what will be built in the iteration
** Responsibilities:
- PO defines potential value of Iteration (Team defines how value will be delivered)
** Result:
- Iteration Goals and a backlog of the team's commitment
** Reciprocal commitment:
- Team commits to delivering specific value
- Stakeholders commit to leaving priorities unchanged during the Iteration

** Capacity allocation for a healthy balance
By having capacity allocation defined, the PO doesn't need to prioritize unlike things against each other
Once the capacity allocation is set, PO and team can prioritize like things against each other.

*** Capacity Allocation
- Helps alleviate velocity degradation due to technical dept
- Keeps existing Customers happy with bug fixes and enhancements
- Can change at Iteration or PI boundaries

** Commit to Iteration Goals
Commitment: Too rigid of a commitment can lead to burnout, inflexibility and quality problems
Adaptability:
