20250707111411-lesson_4_plan_the_work_goal_finish.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-02-02 Mon 08:08 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Lesson 4 Plan the work (Goal - finish)</title>
<meta name="author" content="Michael Leibbrandt" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Lesson 4 Plan the work (Goal - finish)</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org05b346d">1. 4.1 Creating the backlog</a>
<ul>
<li><a href="#org7d1acf8">1.1. Contains all the work for the team</a></li>
<li><a href="#orgf2f2083">1.2. Created by the PO and the team</a></li>
<li><a href="#org514cf36">1.3. Prioritized by the PO</a></li>
<li><a href="#org2275aa0">1.4. Contains User and Enabler Stories</a>
<ul>
<li><a href="#orga4b8973">1.4.1. User Stories provide Customers with value</a></li>
<li><a href="#orga2c67f7">1.4.2. Enabler stories build the infrastructure and architecture that makes User Stories Possibles</a></li>
</ul>
</li>
<li><a href="#org96cead5">1.5. Stories for near-term Iterations are more detailted than Stories for later Iterations</a></li>
<li><a href="#orgb2d222c">1.6. NFRs are backlog contstraints</a>
<ul>
<li><a href="#orgdab0c5b">1.6.1. Backlogs are optimized to help teams focus on priorities</a></li>
<li><a href="#org1422d98">1.6.2. Story maps overcome these challenges</a></li>
<li><a href="#org836b694">1.6.3. Acceptance Criteria</a></li>
</ul>
</li>
<li><a href="#org09ebe5f">1.7. Backlog Refinement</a></li>
<li><a href="#org603a22e">1.8. Fibonacci is used for estimation</a></li>
<li><a href="#orge7fcb35">1.9. Plan -&gt; Do -&gt; Check -&gt; Adjust (At both an iteration and ART level)</a></li>
</ul>
</li>
<li><a href="#org65a3b86">2. 4.2 PI Planning</a>
<ul>
<li><a href="#org7135848">2.1. Innovation: Opportunity for innovation, hackathos and infrastructure improvements</a></li>
<li><a href="#orgf984ad3">2.2. Planning: Provides for cadence-based planning</a>
<ul>
<li><a href="#orgd55fe82">2.2.1. Benefits</a></li>
<li><a href="#org58f2fb1">2.2.2. Create alignment with PI Objectives</a></li>
<li><a href="#org5ca0f07">2.2.3. Uncomitted objectives</a></li>
<li><a href="#org81b5a6a">2.2.4. ROAMing Risks</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgb29c52e">3. 4.3 Team Planning</a>
<ul>
<li><a href="#org1195fe2">3.1. Purpose:</a></li>
<li><a href="#org46252a7">3.2. Responsibilities:</a></li>
<li><a href="#org11b29fd">3.3. Result:</a></li>
<li><a href="#orgb1959f3">3.4. Reciprocal commitment:</a></li>
<li><a href="#orgf68f3e0">3.5. Capacity allocation for a healthy balance</a>
<ul>
<li><a href="#org4984e02">3.5.1. Capacity Allocation</a></li>
</ul>
</li>
<li><a href="#org23b57fa">3.6. Commit to Iteration Goals</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-org05b346d" class="outline-2">
<h2 id="org05b346d"><span class="section-number-2">1.</span> 4.1 Creating the backlog</h2>
<div class="outline-text-2" id="text-1">
<p>
Work originates locally and from broader contexts
Agile team backlog is comprised of Stories
</p>
</div>

<div id="outline-container-org7d1acf8" class="outline-3">
<h3 id="org7d1acf8"><span class="section-number-3">1.1.</span> Contains all the work for the team</h3>
</div>
<div id="outline-container-orgf2f2083" class="outline-3">
<h3 id="orgf2f2083"><span class="section-number-3">1.2.</span> Created by the PO and the team</h3>
</div>
<div id="outline-container-org514cf36" class="outline-3">
<h3 id="org514cf36"><span class="section-number-3">1.3.</span> Prioritized by the PO</h3>
</div>
<div id="outline-container-org2275aa0" class="outline-3">
<h3 id="org2275aa0"><span class="section-number-3">1.4.</span> Contains User and Enabler Stories</h3>
<div class="outline-text-3" id="text-1-4">
</div>
<div id="outline-container-orga4b8973" class="outline-4">
<h4 id="orga4b8973"><span class="section-number-4">1.4.1.</span> User Stories provide Customers with value</h4>
</div>
<div id="outline-container-orga2c67f7" class="outline-4">
<h4 id="orga2c67f7"><span class="section-number-4">1.4.2.</span> Enabler stories build the infrastructure and architecture that makes User Stories Possibles</h4>
</div>
</div>

<div id="outline-container-org96cead5" class="outline-3">
<h3 id="org96cead5"><span class="section-number-3">1.5.</span> Stories for near-term Iterations are more detailted than Stories for later Iterations</h3>
</div>
<div id="outline-container-orgb2d222c" class="outline-3">
<h3 id="orgb2d222c"><span class="section-number-3">1.6.</span> NFRs are backlog contstraints</h3>
<div class="outline-text-3" id="text-1-6">
<p>
Backlog prioritization without connection to the user journey
</p>
</div>
<div id="outline-container-orgdab0c5b" class="outline-4">
<h4 id="orgdab0c5b"><span class="section-number-4">1.6.1.</span> Backlogs are optimized to help teams focus on priorities</h4>
<div class="outline-text-4" id="text-1-6-1">
</div>
<ol class="org-ol">
<li><a id="orgdb9d3e6"></a>Backlogs have some challenges<br />
<div class="outline-text-5" id="text-1-6-1-1">
<ul class="org-ul">
<li>Can be difficult to understand workflows</li>
<li>Relationship between 'Stories that make something good' and 'Stories that make something better or great' is lost</li>
</ul>
</div>
</li>
</ol>
</div>

<div id="outline-container-org1422d98" class="outline-4">
<h4 id="org1422d98"><span class="section-number-4">1.6.2.</span> Story maps overcome these challenges</h4>
<div class="outline-text-4" id="text-1-6-2">
<ul class="org-ul">
<li>Overcome backlog challenges</li>
<li>Story maps feed the backlog: quality, value</li>
</ul>
</div>
</div>

<div id="outline-container-org836b694" class="outline-4">
<h4 id="org836b694"><span class="section-number-4">1.6.3.</span> Acceptance Criteria</h4>
<div class="outline-text-4" id="text-1-6-3">
<ul class="org-ul">
<li>Provide the details of the story from a testing pov</li>
<li>Are created by the agile team</li>
<li>Can be written in the Given-When-Then format</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org09ebe5f" class="outline-3">
<h3 id="org09ebe5f"><span class="section-number-3">1.7.</span> Backlog Refinement</h3>
</div>
<div id="outline-container-org603a22e" class="outline-3">
<h3 id="org603a22e"><span class="section-number-3">1.8.</span> Fibonacci is used for estimation</h3>
</div>

<div id="outline-container-orge7fcb35" class="outline-3">
<h3 id="orge7fcb35"><span class="section-number-3">1.9.</span> Plan -&gt; Do -&gt; Check -&gt; Adjust (At both an iteration and ART level)</h3>
</div>
</div>

<div id="outline-container-org65a3b86" class="outline-2">
<h2 id="org65a3b86"><span class="section-number-2">2.</span> 4.2 PI Planning</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org7135848" class="outline-3">
<h3 id="org7135848"><span class="section-number-3">2.1.</span> Innovation: Opportunity for innovation, hackathos and infrastructure improvements</h3>
</div>
<div id="outline-container-orgf984ad3" class="outline-3">
<h3 id="orgf984ad3"><span class="section-number-3">2.2.</span> Planning: Provides for cadence-based planning</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Buffer for leftover work
Final verification and validation, documentation
Innovation
PI Planning readiness
</p>

<p>
2 day event
</p>
</div>

<div id="outline-container-orgd55fe82" class="outline-4">
<h4 id="orgd55fe82"><span class="section-number-4">2.2.1.</span> Benefits</h4>
<div class="outline-text-4" id="text-2-2-1">
<ul class="org-ul">
<li>Personal communication across all team members and stakeholders</li>
<li>Aligns development of business goals with business context</li>
<li>Identifies dependencies</li>
<li>Allows for faster decision making</li>
</ul>
</div>
</div>

<div id="outline-container-org58f2fb1" class="outline-4">
<h4 id="org58f2fb1"><span class="section-number-4">2.2.2.</span> Create alignment with PI Objectives</h4>
<div class="outline-text-4" id="text-2-2-2">
<ul class="org-ul">
<li>Objectives are business summaries of what each team intends to deliver in the upcoming PI</li>
<li><p>
Often directly relate to intended features in the backlog
</p>

<p>
Before Value (BV)
After Value (AV)
</p></li>
</ul>
</div>
</div>

<div id="outline-container-org5ca0f07" class="outline-4">
<h4 id="org5ca0f07"><span class="section-number-4">2.2.3.</span> Uncomitted objectives</h4>
<div class="outline-text-4" id="text-2-2-3">
<p>
help improve the predictability of delivering business value.
</p>
<ul class="org-ul">
<li>They are planned, not extra things teams do "just in case you have time"</li>
<li>They are not included in the commitment</li>
<li>If a team has low confidence in meeting a PI objective, it should be moved to uncommitted</li>
<li>If an objective has many unknowns, consider moving to uncommitted and putting in early spikes.</li>
<li>Uncommitted objectives count when calculating load</li>
</ul>

<p>
Outcomes of PI planning
</p>
<ul class="org-ul">
<li>Communication</li>
<li>Estimate Capacity</li>
<li>Objectives</li>
<li>Manage Risks</li>
</ul>
</div>
</div>

<div id="outline-container-org81b5a6a" class="outline-4">
<h4 id="org81b5a6a"><span class="section-number-4">2.2.4.</span> ROAMing Risks</h4>
<div class="outline-text-4" id="text-2-2-4">
<ul class="org-ul">
<li>Resolved Has been addressed; No longer a concenrt</li>
<li>Owned Someone has taken responsibility</li>
<li>Accepted Nothing more can be done; if risk occurs, release may be compromised.</li>
<li>Mitigated</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-orgb29c52e" class="outline-2">
<h2 id="orgb29c52e"><span class="section-number-2">3.</span> 4.3 Team Planning</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org1195fe2" class="outline-3">
<h3 id="org1195fe2"><span class="section-number-3">3.1.</span> Purpose:</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>Define and commit to what will be built in the iteration</li>
</ul>
</div>
</div>
<div id="outline-container-org46252a7" class="outline-3">
<h3 id="org46252a7"><span class="section-number-3">3.2.</span> Responsibilities:</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>PO defines potential value of Iteration (Team defines how value will be delivered)</li>
</ul>
</div>
</div>
<div id="outline-container-org11b29fd" class="outline-3">
<h3 id="org11b29fd"><span class="section-number-3">3.3.</span> Result:</h3>
<div class="outline-text-3" id="text-3-3">
<ul class="org-ul">
<li>Iteration Goals and a backlog of the team's commitment</li>
</ul>
</div>
</div>
<div id="outline-container-orgb1959f3" class="outline-3">
<h3 id="orgb1959f3"><span class="section-number-3">3.4.</span> Reciprocal commitment:</h3>
<div class="outline-text-3" id="text-3-4">
<ul class="org-ul">
<li>Team commits to delivering specific value</li>
<li>Stakeholders commit to leaving priorities unchanged during the Iteration</li>
</ul>
</div>
</div>

<div id="outline-container-orgf68f3e0" class="outline-3">
<h3 id="orgf68f3e0"><span class="section-number-3">3.5.</span> Capacity allocation for a healthy balance</h3>
<div class="outline-text-3" id="text-3-5">
<p>
By having capacity allocation defined, the PO doesn't need to prioritize unlike things against each other
Once the capacity allocation is set, PO and team can prioritize like things against each other.
</p>
</div>

<div id="outline-container-org4984e02" class="outline-4">
<h4 id="org4984e02"><span class="section-number-4">3.5.1.</span> Capacity Allocation</h4>
<div class="outline-text-4" id="text-3-5-1">
<ul class="org-ul">
<li>Helps alleviate velocity degradation due to technical dept</li>
<li>Keeps existing Customers happy with bug fixes and enhancements</li>
<li>Can change at Iteration or PI boundaries</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org23b57fa" class="outline-3">
<h3 id="org23b57fa"><span class="section-number-3">3.6.</span> Commit to Iteration Goals</h3>
<div class="outline-text-3" id="text-3-6">
<p>
Commitment: Too rigid of a commitment can lead to burnout, inflexibility and quality problems
Adaptability:
</p>
</div>
</div>
</div>
</div>
</body>
</html>
